{"id":"pubsub/v1/doc/doc_google_protobuf_field_mask","type":"class","overview":"<p>\n  This class allows you interact with Cloud Pub/Sub.\n</p>\n\n\n\n<p>\n  First, install <code>@google-cloud/pubsub</code> with npm:\n</p>\n\n<div hljs language=\"bash\">$ npm install --save @google-cloud/pubsub</div>\n\n<p>\n  If you are running your app on Google Compute Engine, you won't need to worry about supplying connection configuration options to <code>@google-cloud/pubsub</code>— we figure that out for you.\n</p>\n\n<p>\n  However, if you're running your app elsewhere, you will need to provide project details to authenticate API requests.\n</p>\n\n<h4>Google Cloud Platform</h4>\n<div hljs language=\"javascript\">\nvar pubsub = require('@google-cloud/pubsub')();\n</div>\n\n<h4>Elsewhere</h4>\n<div hljs language=\"javascript\">\nvar pubsub = require('@google-cloud/pubsub')({\n  projectId: 'grape-spaceship-123',\n  keyFilename: '/path/to/keyfile.json'\n});\n</div>\n\n<p>\n  The full set of options which can be passed to <code>@google-cloud/pubsub</code> are outlined in our <a href=\"#/docs/pubsub/v0.14.0/guides/authentication\">Authentication guide</a>.\n</p>\n","source":"packages\\pubsub\\src\\v1\\doc\\doc_google_protobuf_field_mask.js","parent":"pubsub","children":[],"methods":[{"type":"instance","description":"<p><code>FieldMask</code> represents a set of symbolic field paths, for example:</p><pre><code>paths: &quot;f.a&quot; paths: &quot;f.b.d&quot; </code></pre><p>Here <code>f</code> represents a field in some root message, <code>a</code> and <code>b</code> fields in the message found in <code>f</code>, and <code>d</code> a field found in the message in <code>f.b</code>.</p><p>Field masks are used to specify a subset of fields that should be returned by a get operation or modified by an update operation. Field masks also have a custom JSON encoding (see below).</p><h1>Field Masks in Projections</h1> <p>When used in the context of a projection, a response message or sub-message is filtered by the API to only contain those fields as specified in the mask. For example, if the mask in the previous example is applied to a response message as follows:</p><pre><code>f { a : 22 b { d : 1 x : 2 } y : 13 } z: 8 </code></pre><p>The result will not contain specific values for fields x,y and z (their value will be set to the default, and omitted in proto text output):</p><pre><code>f { a : 22 b { d : 1 } } </code></pre><p>A repeated field is not allowed except at the last position of a paths string.</p><p>If a FieldMask object is not present in a get operation, the operation applies to all fields (as if a FieldMask of all fields had been specified).</p><p>Note that a field mask does not necessarily apply to the top-level response message. In case of a REST get operation, the field mask applies directly to the response, but in case of a REST list operation, the mask instead applies to each individual message in the returned resource list. In case of a REST custom method, other definitions may be used. Where the mask applies will be clearly documented together with its declaration in the API. In any case, the effect on the returned resource/resources is required behavior for APIs.</p><h1>Field Masks in Update Operations</h1> <p>A field mask in update operations specifies which fields of the targeted resource are going to be updated. The API is required to only change the values of the fields as specified in the mask and leave the others untouched. If a resource is passed in to describe the updated values, the API ignores the values of all fields not covered by the mask.</p><p>If a repeated field is specified for an update operation, the existing repeated values in the target resource will be overwritten by the new values. Note that a repeated field is only allowed in the last position of a <code>paths</code> string.</p><p>If a sub-message is specified in the last position of the field mask for an update operation, then the existing sub-message in the target resource is overwritten. Given the target message:</p><pre><code>f { b { d : 1 x : 2 } c : 1 } </code></pre><p>And an update message:</p><pre><code>f { b { d : 10 } } </code></pre><p>then if the field mask is:</p><p> paths: &quot;f.b&quot;</p><p>then the result will be:</p><pre><code>f { b { d : 10 } c : 1 } </code></pre><p>However, if the update mask was:</p><p> paths: &quot;f.b.d&quot;</p><p>then the result would be:</p><pre><code>f { b { d : 10 x : 2 } c : 1 } </code></pre><p>In order to reset a field&#39;s value to the default, the field must be in the mask and set to the default value in the provided resource. Hence, in order to reset all fields of a resource, provide a default instance of the resource and set all fields in the mask, or do not provide a mask as described below.</p><p>If a field mask is not present on update, the operation applies to all fields (as if a field mask of all fields has been specified). Note that in the presence of schema evolution, this may mean that fields the client does not know and has therefore not filled into the request will be reset to their default. If this is unwanted behavior, a specific service may require a client to always specify a field mask, producing an error if not.</p><p>As with get operations, the location of the resource which describes the updated values in the request message depends on the operation kind. In any case, the effect of the field mask is required to be honored by the API.</p><h2>Considerations for HTTP REST</h2> <p>The HTTP kind of an update operation which uses a field mask must be set to PATCH instead of PUT in order to satisfy HTTP semantics (PUT must only be used for full updates).</p><h1>JSON Encoding of Field Masks</h1> <p>In JSON, a field mask is encoded as a single string where paths are separated by a comma. Fields name in each path are converted to/from lower-camel naming conventions.</p><p>As an example, consider the following message declarations:</p><pre><code>message Profile { User user = 1; Photo photo = 2; } message User { string display_name = 1; string address = 2; } </code></pre><p>In proto a field mask for <code>Profile</code> may look as such:</p><pre><code>mask { paths: &quot;user.display_name&quot; paths: &quot;photo&quot; } </code></pre><p>In JSON, the same mask is represented as below:</p><pre><code>{ mask: &quot;user.displayName,photo&quot; } </code></pre><h1>Field Masks and Oneof Fields</h1> <p>Field masks treat fields in oneofs just as regular fields. Consider the following message:</p><pre><code>message SampleMessage { oneof test_oneof { string name = 4; SubMessage sub_message = 9; } } </code></pre><p>The field mask can be:</p><pre><code>mask { paths: &quot;name&quot; } </code></pre><p>Or:</p><pre><code>mask { paths: &quot;sub_message&quot; } </code></pre><p>Note that oneof type names (&quot;test_oneof&quot; in this case) cannot be used in paths.</p>","source":"packages\\pubsub\\src\\v1\\doc\\doc_google_protobuf_field_mask.js#L231","resources":[],"examples":[],"params":[{"name":"paths","description":"<p> The set of field mask paths.</p>","types":["string[]"],"optional":false,"nullable":false}],"exceptions":[],"returns":[]}],"path":"doc_google_protobuf_field_mask.json"}